#include <iostream>

int CalculateFreeYears(const int allYears)
{
    // Сколько свободных дней жизни насчитали
    int freeDays = 0;
    // Вычитаем от начала взрослой осознанной жизни
    for (int i = 18 + 4; i <= allYears; ++i)
    {
        // Каждый год учитываем выходные и праздничные дни (116 дней всего) и отпуск (30 дней всего)
        freeDays += (116 + 30);
    }
    return (freeDays - 
        // Вычитаем из свободных дней следующие дни:
            // 2 часа каждый день - еда, 7 часов каждый день - сон
            ((2 + 7) 
                // Получаем количество выпавших часов
                * freeDays 
                // Получаем количество выпавших дней
                / 24))
        // Делим оставшиеся свободные дни на 365 и получаем года
        / 365;
}
int main()
{
    for (const int i : {60, 70, 80, 90}) 
    {
        std::cout << i << " -> " << CalculateFreeYears(i) << std::endl;
    }
}